Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/cfg.h
#define CFG_CFGCON0_SMBUS3EN_Pos              _UINT32_(23)                                         /* (CFG_CFGCON0 Position) SMBus3 Enable for SERCOM2 */
#define CFG_CFGCON0_SMBUS3EN_Msk              (_UINT32_(0x1) << CFG_CFGCON0_SMBUS3EN_Pos)          /* (CFG_CFGCON0 Mask) SMBUS3EN */
#define CFG_CFGCON0_SMBUS3EN(value)           (CFG_CFGCON0_SMBUS3EN_Msk & (_UINT32_(value) << CFG_CFGCON0_SMBUS3EN_Pos)) 

/* -------- CFG_CFGCON0CLR : (CFG Offset: 0x04) (R/W 32) Bit clear register -------- */
#define CFG_CFGCON0CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON0CLR) Bit clear register  Reset Value */

#define CFG_CFGCON0CLR_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON0CLR) Register Mask  */


/* -------- CFG_CFGCON0SET : (CFG Offset: 0x08) (R/W 32) Bit set register -------- */
#define CFG_CFGCON0SET_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON0SET) Bit set register  Reset Value */

#define CFG_CFGCON0SET_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON0SET) Register Mask  */


/* -------- CFG_CFGCON0INV : (CFG Offset: 0x0C) (R/W 32) Bit invert register -------- */
#define CFG_CFGCON0INV_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON0INV) Bit invert register  Reset Value */

#define CFG_CFGCON0INV_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON0INV) Register Mask  */


/* -------- CFG_CFGCON1 : (CFG Offset: 0x10) (R/W 32)  -------- */
#define CFG_CFGCON1_RESETVALUE                _UINT32_(0x1F00403B)                                 /*  (CFG_CFGCON1)   Reset Value */

#define CFG_CFGCON1_CAN0_PIN_EN_Pos           _UINT32_(2)                                          /* (CFG_CFGCON1) CAN0 Pin Enable Position */
#define CFG_CFGCON1_CAN0_PIN_EN_Msk           (_UINT32_(0x1) << CFG_CFGCON1_CAN0_PIN_EN_Pos)       /* (CFG_CFGCON1) CAN0 Pin Enable Mask */
#define CFG_CFGCON1_CAN0_PIN_EN(value)        (CFG_CFGCON1_CAN0_PIN_EN_Msk & (_UINT32_(value) << CFG_CFGCON1_CAN0_PIN_EN_Pos)) /* Assigment of value for CAN0_PIN_EN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_TRCEN_Pos                 _UINT32_(5)                                          /* (CFG_CFGCON1) Trace Enable Position */
#define CFG_CFGCON1_TRCEN_Msk                 (_UINT32_(0x1) << CFG_CFGCON1_TRCEN_Pos)             /* (CFG_CFGCON1) Trace Enable Mask */
#define CFG_CFGCON1_TRCEN(value)              (CFG_CFGCON1_TRCEN_Msk & (_UINT32_(value) << CFG_CFGCON1_TRCEN_Pos)) /* Assigment of value for TRCEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CCL_OE_Pos                _UINT32_(6)                                          /* (CFG_CFGCON1) CCL Pads (via PPS) Output Enable Position */
#define CFG_CFGCON1_CCL_OE_Msk                (_UINT32_(0x1) << CFG_CFGCON1_CCL_OE_Pos)            /* (CFG_CFGCON1) CCL Pads (via PPS) Output Enable Mask */
#define CFG_CFGCON1_CCL_OE(value)             (CFG_CFGCON1_CCL_OE_Msk & (_UINT32_(value) << CFG_CFGCON1_CCL_OE_Pos)) /* Assigment of value for CCL_OE in the CFG_CFGCON1 register */
#define CFG_CFGCON1_ZBTWKSYS_Pos              _UINT32_(7)                                          /* (CFG_CFGCON1) ZBT Subsystem External Wake-up source Position */
#define CFG_CFGCON1_ZBTWKSYS_Msk              (_UINT32_(0x1) << CFG_CFGCON1_ZBTWKSYS_Pos)          /* (CFG_CFGCON1) ZBT Subsystem External Wake-up source Mask */
#define CFG_CFGCON1_ZBTWKSYS(value)           (CFG_CFGCON1_ZBTWKSYS_Msk & (_UINT32_(value) << CFG_CFGCON1_ZBTWKSYS_Pos)) /* Assigment of value for ZBTWKSYS in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CMP0_OE_Pos               _UINT32_(8)                                          /* (CFG_CFGCON1) Analog Comparator-0 Output Enable Position */
#define CFG_CFGCON1_CMP0_OE_Msk               (_UINT32_(0x1) << CFG_CFGCON1_CMP0_OE_Pos)           /* (CFG_CFGCON1) Analog Comparator-0 Output Enable Mask */
#define CFG_CFGCON1_CMP0_OE(value)            (CFG_CFGCON1_CMP0_OE_Msk & (_UINT32_(value) << CFG_CFGCON1_CMP0_OE_Pos)) /* Assigment of value for CMP0_OE in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CMP1_OE_Pos               _UINT32_(9)                                          /* (CFG_CFGCON1) Analog Comparator-1 Output Enable Position */
#define CFG_CFGCON1_CMP1_OE_Msk               (_UINT32_(0x1) << CFG_CFGCON1_CMP1_OE_Pos)           /* (CFG_CFGCON1) Analog Comparator-1 Output Enable Mask */
#define CFG_CFGCON1_CMP1_OE(value)            (CFG_CFGCON1_CMP1_OE_Msk & (_UINT32_(value) << CFG_CFGCON1_CMP1_OE_Pos)) /* Assigment of value for CMP1_OE in the CFG_CFGCON1 register */
#define CFG_CFGCON1_QSPI_HSEN_Pos             _UINT32_(10)                                         /* (CFG_CFGCON1) QSPI (Direct) Enable Position */
#define CFG_CFGCON1_QSPI_HSEN_Msk             (_UINT32_(0x1) << CFG_CFGCON1_QSPI_HSEN_Pos)         /* (CFG_CFGCON1) QSPI (Direct) Enable Mask */
#define CFG_CFGCON1_QSPI_HSEN(value)          (CFG_CFGCON1_QSPI_HSEN_Msk & (_UINT32_(value) << CFG_CFGCON1_QSPI_HSEN_Pos)) /* Assigment of value for QSPI_HSEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SCOM0_HSEN_Pos            _UINT32_(11)                                         /* (CFG_CFGCON1) SERCOM0 Direct (High Speed) Pin Enable Position */
#define CFG_CFGCON1_SCOM0_HSEN_Msk            (_UINT32_(0x1) << CFG_CFGCON1_SCOM0_HSEN_Pos)        /* (CFG_CFGCON1) SERCOM0 Direct (High Speed) Pin Enable Mask */
#define CFG_CFGCON1_SCOM0_HSEN(value)         (CFG_CFGCON1_SCOM0_HSEN_Msk & (_UINT32_(value) << CFG_CFGCON1_SCOM0_HSEN_Pos)) /* Assigment of value for SCOM0_HSEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SCOM1_HSEN_Pos            _UINT32_(12)                                         /* (CFG_CFGCON1) SERCOM1 Direct (High Speed) Pin Enable Position */
#define CFG_CFGCON1_SCOM1_HSEN_Msk            (_UINT32_(0x1) << CFG_CFGCON1_SCOM1_HSEN_Pos)        /* (CFG_CFGCON1) SERCOM1 Direct (High Speed) Pin Enable Mask */
#define CFG_CFGCON1_SCOM1_HSEN(value)         (CFG_CFGCON1_SCOM1_HSEN_Msk & (_UINT32_(value) << CFG_CFGCON1_SCOM1_HSEN_Pos)) /* Assigment of value for SCOM1_HSEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SCOM2_HSEN_Pos            _UINT32_(13)                                         /* (CFG_CFGCON1) SERCOM2 Direct (High Speed) Pin Enable Position */
#define CFG_CFGCON1_SCOM2_HSEN_Msk            (_UINT32_(0x1) << CFG_CFGCON1_SCOM2_HSEN_Pos)        /* (CFG_CFGCON1) SERCOM2 Direct (High Speed) Pin Enable Mask */
#define CFG_CFGCON1_SCOM2_HSEN(value)         (CFG_CFGCON1_SCOM2_HSEN_Msk & (_UINT32_(value) << CFG_CFGCON1_SCOM2_HSEN_Pos)) /* Assigment of value for SCOM2_HSEN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_SMCLR_Pos                 _UINT32_(14)                                         /* (CFG_CFGCON1) Selects CRU handling of MCLR Control Position */
#define CFG_CFGCON1_SMCLR_Msk                 (_UINT32_(0x1) << CFG_CFGCON1_SMCLR_Pos)             /* (CFG_CFGCON1) Selects CRU handling of MCLR Control Mask */
#define CFG_CFGCON1_SMCLR(value)              (CFG_CFGCON1_SMCLR_Msk & (_UINT32_(value) << CFG_CFGCON1_SMCLR_Pos)) /* Assigment of value for SMCLR in the CFG_CFGCON1 register */
#define CFG_CFGCON1_QSCHE_EN_Pos              _UINT32_(15)                                         /* (CFG_CFGCON1) QSPI Address Space Cache Attribute Position */
#define CFG_CFGCON1_QSCHE_EN_Msk              (_UINT32_(0x1) << CFG_CFGCON1_QSCHE_EN_Pos)          /* (CFG_CFGCON1) QSPI Address Space Cache Attribute Mask */
#define CFG_CFGCON1_QSCHE_EN(value)           (CFG_CFGCON1_QSCHE_EN_Msk & (_UINT32_(value) << CFG_CFGCON1_QSCHE_EN_Pos)) /* Assigment of value for QSCHE_EN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_USBDMFTRIM_Pos            _UINT32_(16)                                         /* (CFG_CFGCON1) USB DM Fall Trim fuse bits Position */
#define CFG_CFGCON1_USBDMFTRIM_Msk            (_UINT32_(0x3) << CFG_CFGCON1_USBDMFTRIM_Pos)        /* (CFG_CFGCON1) USB DM Fall Trim fuse bits Mask */
#define CFG_CFGCON1_USBDMFTRIM(value)         (CFG_CFGCON1_USBDMFTRIM_Msk & (_UINT32_(value) << CFG_CFGCON1_USBDMFTRIM_Pos)) /* Assigment of value for USBDMFTRIM in the CFG_CFGCON1 register */
#define CFG_CFGCON1_USBDMRTRIM_Pos            _UINT32_(18)                                         /* (CFG_CFGCON1) USB DM Rise Trim fuse bits Position */
#define CFG_CFGCON1_USBDMRTRIM_Msk            (_UINT32_(0x3) << CFG_CFGCON1_USBDMRTRIM_Pos)        /* (CFG_CFGCON1) USB DM Rise Trim fuse bits Mask */
#define CFG_CFGCON1_USBDMRTRIM(value)         (CFG_CFGCON1_USBDMRTRIM_Msk & (_UINT32_(value) << CFG_CFGCON1_USBDMRTRIM_Pos)) /* Assigment of value for USBDMRTRIM in the CFG_CFGCON1 register */
#define CFG_CFGCON1_USBDPFTRIM_Pos            _UINT32_(20)                                         /* (CFG_CFGCON1) USB DP Fall Trim fuse bits Position */
#define CFG_CFGCON1_USBDPFTRIM_Msk            (_UINT32_(0x3) << CFG_CFGCON1_USBDPFTRIM_Pos)        /* (CFG_CFGCON1) USB DP Fall Trim fuse bits Mask */
#define CFG_CFGCON1_USBDPFTRIM(value)         (CFG_CFGCON1_USBDPFTRIM_Msk & (_UINT32_(value) << CFG_CFGCON1_USBDPFTRIM_Pos)) /* Assigment of value for USBDPFTRIM in the CFG_CFGCON1 register */
#define CFG_CFGCON1_USBDPRTRIM_Pos            _UINT32_(22)                                         /* (CFG_CFGCON1) USB DP Rise Trim fuse bits Position */
#define CFG_CFGCON1_USBDPRTRIM_Msk            (_UINT32_(0x3) << CFG_CFGCON1_USBDPRTRIM_Pos)        /* (CFG_CFGCON1) USB DP Rise Trim fuse bits Mask */
#define CFG_CFGCON1_USBDPRTRIM(value)         (CFG_CFGCON1_USBDPRTRIM_Msk & (_UINT32_(value) << CFG_CFGCON1_USBDPRTRIM_Pos)) /* Assigment of value for USBDPRTRIM in the CFG_CFGCON1 register */
#define CFG_CFGCON1_WDTPSS_Pos                _UINT32_(24)                                         /* (CFG_CFGCON1) Watchdog Timer Post-scale Select Sleep Position */
#define CFG_CFGCON1_WDTPSS_Msk                (_UINT32_(0x1F) << CFG_CFGCON1_WDTPSS_Pos)           /* (CFG_CFGCON1) Watchdog Timer Post-scale Select Sleep Mask */
#define CFG_CFGCON1_WDTPSS(value)             (CFG_CFGCON1_WDTPSS_Msk & (_UINT32_(value) << CFG_CFGCON1_WDTPSS_Pos)) /* Assigment of value for WDTPSS in the CFG_CFGCON1 register */
#define CFG_CFGCON1_QSPIDDRM_Pos              _UINT32_(29)                                         /* (CFG_CFGCON1) QSPI DDR Mode Clock Enable Position */
#define CFG_CFGCON1_QSPIDDRM_Msk              (_UINT32_(0x1) << CFG_CFGCON1_QSPIDDRM_Pos)          /* (CFG_CFGCON1) QSPI DDR Mode Clock Enable Mask */
#define CFG_CFGCON1_QSPIDDRM(value)           (CFG_CFGCON1_QSPIDDRM_Msk & (_UINT32_(value) << CFG_CFGCON1_QSPIDDRM_Pos)) /* Assigment of value for QSPIDDRM in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CLKZBREF_Pos              _UINT32_(30)                                         /* (CFG_CFGCON1) External Reference Clock ZB Enable Position */
#define CFG_CFGCON1_CLKZBREF_Msk              (_UINT32_(0x1) << CFG_CFGCON1_CLKZBREF_Pos)          /* (CFG_CFGCON1) External Reference Clock ZB Enable Mask */
#define CFG_CFGCON1_CLKZBREF(value)           (CFG_CFGCON1_CLKZBREF_Msk & (_UINT32_(value) << CFG_CFGCON1_CLKZBREF_Pos)) /* Assigment of value for CLKZBREF in the CFG_CFGCON1 register */
#define CFG_CFGCON1_CAN1_PIN_EN_Pos           _UINT32_(31)                                         /* (CFG_CFGCON1) CAN1 Pin Enable Position */
#define CFG_CFGCON1_CAN1_PIN_EN_Msk           (_UINT32_(0x1) << CFG_CFGCON1_CAN1_PIN_EN_Pos)       /* (CFG_CFGCON1) CAN1 Pin Enable Mask */
#define CFG_CFGCON1_CAN1_PIN_EN(value)        (CFG_CFGCON1_CAN1_PIN_EN_Msk & (_UINT32_(value) << CFG_CFGCON1_CAN1_PIN_EN_Pos)) /* Assigment of value for CAN1_PIN_EN in the CFG_CFGCON1 register */
#define CFG_CFGCON1_Msk                       _UINT32_(0xFFFFFFE4)                                 /* (CFG_CFGCON1) Register Mask  */


/* -------- CFG_CFGCON1CLR : (CFG Offset: 0x14) (R/W 32) Bit clear register -------- */
#define CFG_CFGCON1CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON1CLR) Bit clear register  Reset Value */

