Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/cfg.h
#define CFG_CFGCON1CLR_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON1CLR) Register Mask  */


/* -------- CFG_CFGCON1SET : (CFG Offset: 0x18) (R/W 32) Bit set register -------- */
#define CFG_CFGCON1SET_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON1SET) Bit set register  Reset Value */

#define CFG_CFGCON1SET_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON1SET) Register Mask  */


/* -------- CFG_CFGCON1INV : (CFG Offset: 0x1C) (R/W 32) Bit invert register -------- */
#define CFG_CFGCON1INV_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON1INV) Bit invert register  Reset Value */

#define CFG_CFGCON1INV_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON1INV) Register Mask  */


/* -------- CFG_CFGCON2 : (CFG Offset: 0x20) (R/W 32)  -------- */
#define CFG_CFGCON2_RESETVALUE                _UINT32_(0x7F7FFF38)                                 /*  (CFG_CFGCON2)   Reset Value */

#define CFG_CFGCON2_ACMP_CYCLE_Pos            _UINT32_(0)                                          /* (CFG_CFGCON2) AC SIB Comparator Result Wait Cycles Position */
#define CFG_CFGCON2_ACMP_CYCLE_Msk            (_UINT32_(0x7) << CFG_CFGCON2_ACMP_CYCLE_Pos)        /* (CFG_CFGCON2) AC SIB Comparator Result Wait Cycles Mask */
#define CFG_CFGCON2_ACMP_CYCLE(value)         (CFG_CFGCON2_ACMP_CYCLE_Msk & (_UINT32_(value) << CFG_CFGCON2_ACMP_CYCLE_Pos)) /* Assigment of value for ACMP_CYCLE in the CFG_CFGCON2 register */
#define CFG_CFGCON2_DMTINTV_Pos               _UINT32_(3)                                          /* (CFG_CFGCON2) Dead Man Timer Count Window Interval Position */
#define CFG_CFGCON2_DMTINTV_Msk               (_UINT32_(0x7) << CFG_CFGCON2_DMTINTV_Pos)           /* (CFG_CFGCON2) Dead Man Timer Count Window Interval Mask */
#define CFG_CFGCON2_DMTINTV(value)            (CFG_CFGCON2_DMTINTV_Msk & (_UINT32_(value) << CFG_CFGCON2_DMTINTV_Pos)) /* Assigment of value for DMTINTV in the CFG_CFGCON2 register */
#define CFG_CFGCON2_PMUTEST_VDD_EN_Pos        _UINT32_(7)                                          /* (CFG_CFGCON2) PMU Test Output or VDD/2 Enable via ADC IE12 Position */
#define CFG_CFGCON2_PMUTEST_VDD_EN_Msk        (_UINT32_(0x1) << CFG_CFGCON2_PMUTEST_VDD_EN_Pos)    /* (CFG_CFGCON2) PMU Test Output or VDD/2 Enable via ADC IE12 Mask */
#define CFG_CFGCON2_PMUTEST_VDD_EN(value)     (CFG_CFGCON2_PMUTEST_VDD_EN_Msk & (_UINT32_(value) << CFG_CFGCON2_PMUTEST_VDD_EN_Pos)) /* Assigment of value for PMUTEST_VDD_EN in the CFG_CFGCON2 register */
#define CFG_CFGCON2_POSCMOD_Pos               _UINT32_(8)                                          /* (CFG_CFGCON2) Primary Oscillator Configuration Position */
#define CFG_CFGCON2_POSCMOD_Msk               (_UINT32_(0x3) << CFG_CFGCON2_POSCMOD_Pos)           /* (CFG_CFGCON2) Primary Oscillator Configuration Mask */
#define CFG_CFGCON2_POSCMOD(value)            (CFG_CFGCON2_POSCMOD_Msk & (_UINT32_(value) << CFG_CFGCON2_POSCMOD_Pos)) /* Assigment of value for POSCMOD in the CFG_CFGCON2 register */
#define CFG_CFGCON2_WDTRMCS_Pos               _UINT32_(10)                                         /* (CFG_CFGCON2) WDT RUN Mode Clock Select Position */
#define CFG_CFGCON2_WDTRMCS_Msk               (_UINT32_(0x3) << CFG_CFGCON2_WDTRMCS_Pos)           /* (CFG_CFGCON2) WDT RUN Mode Clock Select Mask */
#define CFG_CFGCON2_WDTRMCS(value)            (CFG_CFGCON2_WDTRMCS_Msk & (_UINT32_(value) << CFG_CFGCON2_WDTRMCS_Pos)) /* Assigment of value for WDTRMCS in the CFG_CFGCON2 register */
#define CFG_CFGCON2_SOSCSEL_Pos               _UINT32_(12)                                         /* (CFG_CFGCON2) SOSC Selection Configuration Position */
#define CFG_CFGCON2_SOSCSEL_Msk               (_UINT32_(0x1) << CFG_CFGCON2_SOSCSEL_Pos)           /* (CFG_CFGCON2) SOSC Selection Configuration Mask */
#define CFG_CFGCON2_SOSCSEL(value)            (CFG_CFGCON2_SOSCSEL_Msk & (_UINT32_(value) << CFG_CFGCON2_SOSCSEL_Pos)) /* Assigment of value for SOSCSEL in the CFG_CFGCON2 register */
#define CFG_CFGCON2_WAKE2SPD_Pos              _UINT32_(13)                                         /* (CFG_CFGCON2) 2-Speed startup enabled in Sleep mode Position */
#define CFG_CFGCON2_WAKE2SPD_Msk              (_UINT32_(0x1) << CFG_CFGCON2_WAKE2SPD_Pos)          /* (CFG_CFGCON2) 2-Speed startup enabled in Sleep mode Mask */
#define CFG_CFGCON2_WAKE2SPD(value)           (CFG_CFGCON2_WAKE2SPD_Msk & (_UINT32_(value) << CFG_CFGCON2_WAKE2SPD_Pos)) /* Assigment of value for WAKE2SPD in the CFG_CFGCON2 register */
#define CFG_CFGCON2_CKSWEN_Pos                _UINT32_(14)                                         /* (CFG_CFGCON2) Software Clock Switching Enable Position */
#define CFG_CFGCON2_CKSWEN_Msk                (_UINT32_(0x1) << CFG_CFGCON2_CKSWEN_Pos)            /* (CFG_CFGCON2) Software Clock Switching Enable Mask */
#define CFG_CFGCON2_CKSWEN(value)             (CFG_CFGCON2_CKSWEN_Msk & (_UINT32_(value) << CFG_CFGCON2_CKSWEN_Pos)) /* Assigment of value for CKSWEN in the CFG_CFGCON2 register */
#define CFG_CFGCON2_FSCMEN_Pos                _UINT32_(15)                                         /* (CFG_CFGCON2) Fail-Safe Clock Monitor Enable Position */
#define CFG_CFGCON2_FSCMEN_Msk                (_UINT32_(0x1) << CFG_CFGCON2_FSCMEN_Pos)            /* (CFG_CFGCON2) Fail-Safe Clock Monitor Enable Mask */
#define CFG_CFGCON2_FSCMEN(value)             (CFG_CFGCON2_FSCMEN_Msk & (_UINT32_(value) << CFG_CFGCON2_FSCMEN_Pos)) /* Assigment of value for FSCMEN in the CFG_CFGCON2 register */
#define CFG_CFGCON2_WDTPSR_Pos                _UINT32_(16)                                         /* (CFG_CFGCON2) Watchdog Timer Post-scale Select Run Position */
#define CFG_CFGCON2_WDTPSR_Msk                (_UINT32_(0x1F) << CFG_CFGCON2_WDTPSR_Pos)           /* (CFG_CFGCON2) Watchdog Timer Post-scale Select Run Mask */
#define CFG_CFGCON2_WDTPSR(value)             (CFG_CFGCON2_WDTPSR_Msk & (_UINT32_(value) << CFG_CFGCON2_WDTPSR_Pos)) /* Assigment of value for WDTPSR in the CFG_CFGCON2 register */
#define CFG_CFGCON2_WDTSPGM_Pos               _UINT32_(21)                                         /* (CFG_CFGCON2) Watchdog Timer Stop during Flash Programming Position */
#define CFG_CFGCON2_WDTSPGM_Msk               (_UINT32_(0x1) << CFG_CFGCON2_WDTSPGM_Pos)           /* (CFG_CFGCON2) Watchdog Timer Stop during Flash Programming Mask */
#define CFG_CFGCON2_WDTSPGM(value)            (CFG_CFGCON2_WDTSPGM_Msk & (_UINT32_(value) << CFG_CFGCON2_WDTSPGM_Pos)) /* Assigment of value for WDTSPGM in the CFG_CFGCON2 register */
#define CFG_CFGCON2_WINDIS_Pos                _UINT32_(22)                                         /* (CFG_CFGCON2) Windowed Watchdog Timer Disable Position */
#define CFG_CFGCON2_WINDIS_Msk                (_UINT32_(0x1) << CFG_CFGCON2_WINDIS_Pos)            /* (CFG_CFGCON2) Windowed Watchdog Timer Disable Mask */
#define CFG_CFGCON2_WINDIS(value)             (CFG_CFGCON2_WINDIS_Msk & (_UINT32_(value) << CFG_CFGCON2_WINDIS_Pos)) /* Assigment of value for WINDIS in the CFG_CFGCON2 register */
#define CFG_CFGCON2_WDTEN_Pos                 _UINT32_(23)                                         /* (CFG_CFGCON2) Watchdog Timer Enable Position */
#define CFG_CFGCON2_WDTEN_Msk                 (_UINT32_(0x1) << CFG_CFGCON2_WDTEN_Pos)             /* (CFG_CFGCON2) Watchdog Timer Enable Mask */
#define CFG_CFGCON2_WDTEN(value)              (CFG_CFGCON2_WDTEN_Msk & (_UINT32_(value) << CFG_CFGCON2_WDTEN_Pos)) /* Assigment of value for WDTEN in the CFG_CFGCON2 register */
#define CFG_CFGCON2_WDTWINSZ_Pos              _UINT32_(24)                                         /* (CFG_CFGCON2) Watchdog Timer Window Size Position */
#define CFG_CFGCON2_WDTWINSZ_Msk              (_UINT32_(0x3) << CFG_CFGCON2_WDTWINSZ_Pos)          /* (CFG_CFGCON2) Watchdog Timer Window Size Mask */
#define CFG_CFGCON2_WDTWINSZ(value)           (CFG_CFGCON2_WDTWINSZ_Msk & (_UINT32_(value) << CFG_CFGCON2_WDTWINSZ_Pos)) /* Assigment of value for WDTWINSZ in the CFG_CFGCON2 register */
#define CFG_CFGCON2_DMTCNT_Pos                _UINT32_(26)                                         /* (CFG_CFGCON2) Dead Man Timer Count Select Position */
#define CFG_CFGCON2_DMTCNT_Msk                (_UINT32_(0x1F) << CFG_CFGCON2_DMTCNT_Pos)           /* (CFG_CFGCON2) Dead Man Timer Count Select Mask */
#define CFG_CFGCON2_DMTCNT(value)             (CFG_CFGCON2_DMTCNT_Msk & (_UINT32_(value) << CFG_CFGCON2_DMTCNT_Pos)) /* Assigment of value for DMTCNT in the CFG_CFGCON2 register */
#define CFG_CFGCON2_DMTEN_Pos                 _UINT32_(31)                                         /* (CFG_CFGCON2) Dead Man Timer Enable Position */
#define CFG_CFGCON2_DMTEN_Msk                 (_UINT32_(0x1) << CFG_CFGCON2_DMTEN_Pos)             /* (CFG_CFGCON2) Dead Man Timer Enable Mask */
#define CFG_CFGCON2_DMTEN(value)              (CFG_CFGCON2_DMTEN_Msk & (_UINT32_(value) << CFG_CFGCON2_DMTEN_Pos)) /* Assigment of value for DMTEN in the CFG_CFGCON2 register */
#define CFG_CFGCON2_Msk                       _UINT32_(0xFFFFFFBF)                                 /* (CFG_CFGCON2) Register Mask  */


/* -------- CFG_CFGCON2CLR : (CFG Offset: 0x24) (R/W 32) Bit clear register -------- */
#define CFG_CFGCON2CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON2CLR) Bit clear register  Reset Value */

#define CFG_CFGCON2CLR_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON2CLR) Register Mask  */


/* -------- CFG_CFGCON2SET : (CFG Offset: 0x28) (R/W 32) Bit set register -------- */
#define CFG_CFGCON2SET_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON2SET) Bit set register  Reset Value */

#define CFG_CFGCON2SET_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON2SET) Register Mask  */


/* -------- CFG_CFGCON2INV : (CFG Offset: 0x2C) (R/W 32) Bit invert register -------- */
#define CFG_CFGCON2INV_RESETVALUE             _UINT32_(0x00)                                       /*  (CFG_CFGCON2INV) Bit invert register  Reset Value */

#define CFG_CFGCON2INV_Msk                    _UINT32_(0x00000000)                                 /* (CFG_CFGCON2INV) Register Mask  */


/* -------- CFG_CFGCON4 : (CFG Offset: 0x40) (R/W 32)  -------- */
#define CFG_CFGCON4_RESETVALUE                _UINT32_(0x840E4000)                                 /*  (CFG_CFGCON4)   Reset Value */

