Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/cfg.h
/* -------- CFG_CFGPCLKGEN1CLR : (CFG Offset: 0x84) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN1CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN1CLR_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN1CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN1SET : (CFG Offset: 0x88) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN1SET_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN1SET_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN1SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN1INV : (CFG Offset: 0x8C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN1INV_RESETVALUE         _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1INV) Bit invert register  Reset Value */

#define CFG_CFGPCLKGEN1INV_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN1INV) Register Mask  */


/* -------- CFG_CFGPCLKGEN2 : (CFG Offset: 0x90) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN2_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN2)   Reset Value */

#define CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos        _UINT32_(0)                                          /* (CFG_CFGPCLKGEN2) EVSYSC1 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC1 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL(value)     (CFG_CFGPCLKGEN2_EVSYSC1SEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos)) /* Assigment of value for EVSYSC1SEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC1SEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYSC1SEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_NO_CLK     (CFG_CFGPCLKGEN2_EVSYSC1SEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO1      (CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO2      (CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO3      (CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO4      (CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO5      (CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO6      (CFG_CFGPCLKGEN2_EVSYSC1SEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1SEL_LPCLK      (CFG_CFGPCLKGEN2_EVSYSC1SEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYSC1SEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1CD_Pos         _UINT32_(3)                                          /* (CFG_CFGPCLKGEN2) EVSYSC1 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYSC1CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYSC1CD_Pos)     /* (CFG_CFGPCLKGEN2) EVSYSC1 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYSC1CD(value)      (CFG_CFGPCLKGEN2_EVSYSC1CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC1CD_Pos)) /* Assigment of value for EVSYSC1CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC1CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYSC1CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYSC1CD_ON          (CFG_CFGPCLKGEN2_EVSYSC1CD_ON_Val << CFG_CFGPCLKGEN2_EVSYSC1CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC1CD_OFF         (CFG_CFGPCLKGEN2_EVSYSC1CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYSC1CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos        _UINT32_(4)                                          /* (CFG_CFGPCLKGEN2) EVSYSC2 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC2 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL(value)     (CFG_CFGPCLKGEN2_EVSYSC2SEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos)) /* Assigment of value for EVSYSC2SEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC2SEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYSC2SEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_NO_CLK     (CFG_CFGPCLKGEN2_EVSYSC2SEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO1      (CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO2      (CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO3      (CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO4      (CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO5      (CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO6      (CFG_CFGPCLKGEN2_EVSYSC2SEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2SEL_LPCLK      (CFG_CFGPCLKGEN2_EVSYSC2SEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYSC2SEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2CD_Pos         _UINT32_(7)                                          /* (CFG_CFGPCLKGEN2) EVSYSC2 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYSC2CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYSC2CD_Pos)     /* (CFG_CFGPCLKGEN2) EVSYSC2 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYSC2CD(value)      (CFG_CFGPCLKGEN2_EVSYSC2CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC2CD_Pos)) /* Assigment of value for EVSYSC2CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC2CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYSC2CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYSC2CD_ON          (CFG_CFGPCLKGEN2_EVSYSC2CD_ON_Val << CFG_CFGPCLKGEN2_EVSYSC2CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC2CD_OFF         (CFG_CFGPCLKGEN2_EVSYSC2CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYSC2CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos        _UINT32_(8)                                          /* (CFG_CFGPCLKGEN2) EVSYSC3 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC3 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL(value)     (CFG_CFGPCLKGEN2_EVSYSC3SEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos)) /* Assigment of value for EVSYSC3SEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC3SEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYSC3SEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_NO_CLK     (CFG_CFGPCLKGEN2_EVSYSC3SEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO1      (CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO2      (CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO3      (CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO4      (CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO5      (CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO6      (CFG_CFGPCLKGEN2_EVSYSC3SEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3SEL_LPCLK      (CFG_CFGPCLKGEN2_EVSYSC3SEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYSC3SEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3CD_Pos         _UINT32_(11)                                         /* (CFG_CFGPCLKGEN2) EVSYSC3 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYSC3CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYSC3CD_Pos)     /* (CFG_CFGPCLKGEN2) EVSYSC3 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYSC3CD(value)      (CFG_CFGPCLKGEN2_EVSYSC3CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC3CD_Pos)) /* Assigment of value for EVSYSC3CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC3CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYSC3CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYSC3CD_ON          (CFG_CFGPCLKGEN2_EVSYSC3CD_ON_Val << CFG_CFGPCLKGEN2_EVSYSC3CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC3CD_OFF         (CFG_CFGPCLKGEN2_EVSYSC3CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYSC3CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos        _UINT32_(12)                                         /* (CFG_CFGPCLKGEN2) EVSYSC4 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC4 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL(value)     (CFG_CFGPCLKGEN2_EVSYSC4SEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos)) /* Assigment of value for EVSYSC4SEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC4SEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYSC4SEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_NO_CLK     (CFG_CFGPCLKGEN2_EVSYSC4SEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO1      (CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO2      (CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO3      (CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO4      (CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO5      (CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO6      (CFG_CFGPCLKGEN2_EVSYSC4SEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4SEL_LPCLK      (CFG_CFGPCLKGEN2_EVSYSC4SEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYSC4SEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4CD_Pos         _UINT32_(15)                                         /* (CFG_CFGPCLKGEN2) EVSYSC4 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYSC4CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYSC4CD_Pos)     /* (CFG_CFGPCLKGEN2) EVSYSC4 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYSC4CD(value)      (CFG_CFGPCLKGEN2_EVSYSC4CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC4CD_Pos)) /* Assigment of value for EVSYSC4CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC4CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYSC4CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYSC4CD_ON          (CFG_CFGPCLKGEN2_EVSYSC4CD_ON_Val << CFG_CFGPCLKGEN2_EVSYSC4CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC4CD_OFF         (CFG_CFGPCLKGEN2_EVSYSC4CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYSC4CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos        _UINT32_(16)                                         /* (CFG_CFGPCLKGEN2) EVSYSC5 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC5 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL(value)     (CFG_CFGPCLKGEN2_EVSYSC5SEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos)) /* Assigment of value for EVSYSC5SEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC5SEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYSC5SEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_NO_CLK     (CFG_CFGPCLKGEN2_EVSYSC5SEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO1      (CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO2      (CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO3      (CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO4      (CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO5      (CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO6      (CFG_CFGPCLKGEN2_EVSYSC5SEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5SEL_LPCLK      (CFG_CFGPCLKGEN2_EVSYSC5SEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYSC5SEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5CD_Pos         _UINT32_(19)                                         /* (CFG_CFGPCLKGEN2) EVSYSC5 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYSC5CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYSC5CD_Pos)     /* (CFG_CFGPCLKGEN2) EVSYSC5 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYSC5CD(value)      (CFG_CFGPCLKGEN2_EVSYSC5CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC5CD_Pos)) /* Assigment of value for EVSYSC5CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC5CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYSC5CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYSC5CD_ON          (CFG_CFGPCLKGEN2_EVSYSC5CD_ON_Val << CFG_CFGPCLKGEN2_EVSYSC5CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC5CD_OFF         (CFG_CFGPCLKGEN2_EVSYSC5CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYSC5CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos        _UINT32_(20)                                         /* (CFG_CFGPCLKGEN2) EVSYSC6 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC6 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL(value)     (CFG_CFGPCLKGEN2_EVSYSC6SEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos)) /* Assigment of value for EVSYSC6SEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC6SEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYSC6SEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_NO_CLK     (CFG_CFGPCLKGEN2_EVSYSC6SEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position  */
