Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/cfg.h
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO1      (CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO2      (CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO3      (CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO4      (CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO5      (CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO6      (CFG_CFGPCLKGEN2_EVSYSC6SEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6SEL_LPCLK      (CFG_CFGPCLKGEN2_EVSYSC6SEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYSC6SEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6CD_Pos         _UINT32_(23)                                         /* (CFG_CFGPCLKGEN2) EVSYSC6 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYSC6CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYSC6CD_Pos)     /* (CFG_CFGPCLKGEN2) EVSYSC6 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYSC6CD(value)      (CFG_CFGPCLKGEN2_EVSYSC6CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC6CD_Pos)) /* Assigment of value for EVSYSC6CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC6CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYSC6CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYSC6CD_ON          (CFG_CFGPCLKGEN2_EVSYSC6CD_ON_Val << CFG_CFGPCLKGEN2_EVSYSC6CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC6CD_OFF         (CFG_CFGPCLKGEN2_EVSYSC6CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYSC6CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos        _UINT32_(24)                                         /* (CFG_CFGPCLKGEN2) EVSYSC7 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC7 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL(value)     (CFG_CFGPCLKGEN2_EVSYSC7SEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos)) /* Assigment of value for EVSYSC7SEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC7SEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYSC7SEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_NO_CLK     (CFG_CFGPCLKGEN2_EVSYSC7SEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO1      (CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO2      (CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO3      (CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO4      (CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO5      (CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO6      (CFG_CFGPCLKGEN2_EVSYSC7SEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7SEL_LPCLK      (CFG_CFGPCLKGEN2_EVSYSC7SEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYSC7SEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7CD_Pos         _UINT32_(27)                                         /* (CFG_CFGPCLKGEN2) EVSYSC7 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYSC7CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYSC7CD_Pos)     /* (CFG_CFGPCLKGEN2) EVSYSC7 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYSC7CD(value)      (CFG_CFGPCLKGEN2_EVSYSC7CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC7CD_Pos)) /* Assigment of value for EVSYSC7CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC7CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYSC7CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYSC7CD_ON          (CFG_CFGPCLKGEN2_EVSYSC7CD_ON_Val << CFG_CFGPCLKGEN2_EVSYSC7CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC7CD_OFF         (CFG_CFGPCLKGEN2_EVSYSC7CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYSC7CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos        _UINT32_(28)                                         /* (CFG_CFGPCLKGEN2) EVSYSC8 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_Msk        (_UINT32_(0x7) << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos)    /* (CFG_CFGPCLKGEN2) EVSYSC8 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL(value)     (CFG_CFGPCLKGEN2_EVSYSC8SEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos)) /* Assigment of value for EVSYSC8SEL in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC8SEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) No Clock  */
#define   CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO1_Val _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 1  */
#define   CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO2_Val _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 2  */
#define   CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO3_Val _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 3  */
#define   CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO4_Val _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 4  */
#define   CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO5_Val _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 5  */
#define   CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO6_Val _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN2) Reference Clock 6  */
#define   CFG_CFGPCLKGEN2_EVSYSC8SEL_LPCLK_Val _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_NO_CLK     (CFG_CFGPCLKGEN2_EVSYSC8SEL_NO_CLK_Val << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos) /* (CFG_CFGPCLKGEN2) No Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO1      (CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO1_Val << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO2      (CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO2_Val << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO3      (CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO3_Val << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO4      (CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO4_Val << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO5      (CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO5_Val << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO6      (CFG_CFGPCLKGEN2_EVSYSC8SEL_REFO6_Val << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos) /* (CFG_CFGPCLKGEN2) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8SEL_LPCLK      (CFG_CFGPCLKGEN2_EVSYSC8SEL_LPCLK_Val << CFG_CFGPCLKGEN2_EVSYSC8SEL_Pos) /* (CFG_CFGPCLKGEN2) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8CD_Pos         _UINT32_(31)                                         /* (CFG_CFGPCLKGEN2) EVSYSC8 Clock Disable Position */
#define CFG_CFGPCLKGEN2_EVSYSC8CD_Msk         (_UINT32_(0x1) << CFG_CFGPCLKGEN2_EVSYSC8CD_Pos)     /* (CFG_CFGPCLKGEN2) EVSYSC8 Clock Disable Mask */
#define CFG_CFGPCLKGEN2_EVSYSC8CD(value)      (CFG_CFGPCLKGEN2_EVSYSC8CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN2_EVSYSC8CD_Pos)) /* Assigment of value for EVSYSC8CD in the CFG_CFGPCLKGEN2 register */
#define   CFG_CFGPCLKGEN2_EVSYSC8CD_ON_Val    _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN2) Enable PGCLK  */
#define   CFG_CFGPCLKGEN2_EVSYSC8CD_OFF_Val   _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN2) Disable PGCLK  */
#define CFG_CFGPCLKGEN2_EVSYSC8CD_ON          (CFG_CFGPCLKGEN2_EVSYSC8CD_ON_Val << CFG_CFGPCLKGEN2_EVSYSC8CD_Pos) /* (CFG_CFGPCLKGEN2) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN2_EVSYSC8CD_OFF         (CFG_CFGPCLKGEN2_EVSYSC8CD_OFF_Val << CFG_CFGPCLKGEN2_EVSYSC8CD_Pos) /* (CFG_CFGPCLKGEN2) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN2_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGPCLKGEN2) Register Mask  */


