Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/cfg.h
#define CFG_CFGPCLKGEN3INV_Msk                _UINT32_(0x00000000)                                 /* (CFG_CFGPCLKGEN3INV) Register Mask  */


/* -------- CFG_CFGPCLKGEN4 : (CFG Offset: 0xB0) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN4_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN4)   Reset Value */

#define CFG_CFGPCLKGEN4_TC0CSEL_Pos           _UINT32_(0)                                          /* (CFG_CFGPCLKGEN4) TC0 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC0CSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC0CSEL_Pos)       /* (CFG_CFGPCLKGEN4) TC0 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC0CSEL(value)        (CFG_CFGPCLKGEN4_TC0CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC0CSEL_Pos)) /* Assigment of value for TC0CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC0CSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC0CSEL_NO_CLK        (CFG_CFGPCLKGEN4_TC0CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO1         (CFG_CFGPCLKGEN4_TC0CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO2         (CFG_CFGPCLKGEN4_TC0CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO3         (CFG_CFGPCLKGEN4_TC0CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO4         (CFG_CFGPCLKGEN4_TC0CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO5         (CFG_CFGPCLKGEN4_TC0CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO6         (CFG_CFGPCLKGEN4_TC0CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_LPCLK         (CFG_CFGPCLKGEN4_TC0CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC0CD_Pos             _UINT32_(3)                                          /* (CFG_CFGPCLKGEN4) TC0 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC0CD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC0CD_Pos)         /* (CFG_CFGPCLKGEN4) TC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC0CD(value)          (CFG_CFGPCLKGEN4_TC0CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC0CD_Pos)) /* Assigment of value for TC0CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC0CD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC0CD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC0CD_ON              (CFG_CFGPCLKGEN4_TC0CD_ON_Val << CFG_CFGPCLKGEN4_TC0CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC0CD_OFF             (CFG_CFGPCLKGEN4_TC0CD_OFF_Val << CFG_CFGPCLKGEN4_TC0CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_Pos           _UINT32_(4)                                          /* (CFG_CFGPCLKGEN4) TC1 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC1CSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC1CSEL_Pos)       /* (CFG_CFGPCLKGEN4) TC1 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC1CSEL(value)        (CFG_CFGPCLKGEN4_TC1CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC1CSEL_Pos)) /* Assigment of value for TC1CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC1CSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC1CSEL_NO_CLK        (CFG_CFGPCLKGEN4_TC1CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO1         (CFG_CFGPCLKGEN4_TC1CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO2         (CFG_CFGPCLKGEN4_TC1CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO3         (CFG_CFGPCLKGEN4_TC1CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO4         (CFG_CFGPCLKGEN4_TC1CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO5         (CFG_CFGPCLKGEN4_TC1CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO6         (CFG_CFGPCLKGEN4_TC1CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_LPCLK         (CFG_CFGPCLKGEN4_TC1CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC1CD_Pos             _UINT32_(7)                                          /* (CFG_CFGPCLKGEN4) TC1 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC1CD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC1CD_Pos)         /* (CFG_CFGPCLKGEN4) TC1 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC1CD(value)          (CFG_CFGPCLKGEN4_TC1CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC1CD_Pos)) /* Assigment of value for TC1CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC1CD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC1CD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC1CD_ON              (CFG_CFGPCLKGEN4_TC1CD_ON_Val << CFG_CFGPCLKGEN4_TC1CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC1CD_OFF             (CFG_CFGPCLKGEN4_TC1CD_OFF_Val << CFG_CFGPCLKGEN4_TC1CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_Pos          _UINT32_(8)                                          /* (CFG_CFGPCLKGEN4) TC23 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC23CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC23CSEL_Pos)      /* (CFG_CFGPCLKGEN4) TC23 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC23CSEL(value)       (CFG_CFGPCLKGEN4_TC23CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC23CSEL_Pos)) /* Assigment of value for TC23CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC23CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC23CSEL_NO_CLK       (CFG_CFGPCLKGEN4_TC23CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO1        (CFG_CFGPCLKGEN4_TC23CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO2        (CFG_CFGPCLKGEN4_TC23CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO3        (CFG_CFGPCLKGEN4_TC23CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO4        (CFG_CFGPCLKGEN4_TC23CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO5        (CFG_CFGPCLKGEN4_TC23CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO6        (CFG_CFGPCLKGEN4_TC23CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_LPCLK        (CFG_CFGPCLKGEN4_TC23CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC23CD_Pos            _UINT32_(11)                                         /* (CFG_CFGPCLKGEN4) TC23 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC23CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC23CD_Pos)        /* (CFG_CFGPCLKGEN4) TC23 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC23CD(value)         (CFG_CFGPCLKGEN4_TC23CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC23CD_Pos)) /* Assigment of value for TC23CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC23CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC23CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC23CD_ON             (CFG_CFGPCLKGEN4_TC23CD_ON_Val << CFG_CFGPCLKGEN4_TC23CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC23CD_OFF            (CFG_CFGPCLKGEN4_TC23CD_OFF_Val << CFG_CFGPCLKGEN4_TC23CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC45CSEL_Pos          _UINT32_(12)                                         /* (CFG_CFGPCLKGEN4) TC45 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC45CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC45CSEL_Pos)      /* (CFG_CFGPCLKGEN4) TC45 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC45CSEL(value)       (CFG_CFGPCLKGEN4_TC45CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC45CSEL_Pos)) /* Assigment of value for TC45CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC45CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC45CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC45CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC45CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC45CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC45CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC45CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC45CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC45CSEL_NO_CLK       (CFG_CFGPCLKGEN4_TC45CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC45CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC45CSEL_REFO1        (CFG_CFGPCLKGEN4_TC45CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC45CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC45CSEL_REFO2        (CFG_CFGPCLKGEN4_TC45CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC45CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC45CSEL_REFO3        (CFG_CFGPCLKGEN4_TC45CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC45CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC45CSEL_REFO4        (CFG_CFGPCLKGEN4_TC45CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC45CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC45CSEL_REFO5        (CFG_CFGPCLKGEN4_TC45CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC45CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC45CSEL_REFO6        (CFG_CFGPCLKGEN4_TC45CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC45CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC45CSEL_LPCLK        (CFG_CFGPCLKGEN4_TC45CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC45CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC45CD_Pos            _UINT32_(15)                                         /* (CFG_CFGPCLKGEN4) TC45 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC45CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC45CD_Pos)        /* (CFG_CFGPCLKGEN4) TC45 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC45CD(value)         (CFG_CFGPCLKGEN4_TC45CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC45CD_Pos)) /* Assigment of value for TC45CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC45CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC45CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC45CD_ON             (CFG_CFGPCLKGEN4_TC45CD_ON_Val << CFG_CFGPCLKGEN4_TC45CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC45CD_OFF            (CFG_CFGPCLKGEN4_TC45CD_OFF_Val << CFG_CFGPCLKGEN4_TC45CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_Pos          _UINT32_(16)                                         /* (CFG_CFGPCLKGEN4) TC67 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC67CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC67CSEL_Pos)      /* (CFG_CFGPCLKGEN4) TC67 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC67CSEL(value)       (CFG_CFGPCLKGEN4_TC67CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC67CSEL_Pos)) /* Assigment of value for TC67CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC67CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC67CSEL_NO_CLK       (CFG_CFGPCLKGEN4_TC67CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO1        (CFG_CFGPCLKGEN4_TC67CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO2        (CFG_CFGPCLKGEN4_TC67CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO3        (CFG_CFGPCLKGEN4_TC67CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO4        (CFG_CFGPCLKGEN4_TC67CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO5        (CFG_CFGPCLKGEN4_TC67CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO6        (CFG_CFGPCLKGEN4_TC67CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_LPCLK        (CFG_CFGPCLKGEN4_TC67CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC67CD_Pos            _UINT32_(19)                                         /* (CFG_CFGPCLKGEN4) TC67 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC67CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC67CD_Pos)        /* (CFG_CFGPCLKGEN4) TC67 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC67CD(value)         (CFG_CFGPCLKGEN4_TC67CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC67CD_Pos)) /* Assigment of value for TC67CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC67CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC67CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC67CD_ON             (CFG_CFGPCLKGEN4_TC67CD_ON_Val << CFG_CFGPCLKGEN4_TC67CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC67CD_OFF            (CFG_CFGPCLKGEN4_TC67CD_OFF_Val << CFG_CFGPCLKGEN4_TC67CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC89CSEL_Pos          _UINT32_(20)                                         /* (CFG_CFGPCLKGEN4) TC89 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC89CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC89CSEL_Pos)      /* (CFG_CFGPCLKGEN4) TC89 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC89CSEL(value)       (CFG_CFGPCLKGEN4_TC89CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC89CSEL_Pos)) /* Assigment of value for TC89CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC89CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC89CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC89CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC89CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC89CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC89CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC89CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC89CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC89CSEL_NO_CLK       (CFG_CFGPCLKGEN4_TC89CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC89CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC89CSEL_REFO1        (CFG_CFGPCLKGEN4_TC89CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC89CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC89CSEL_REFO2        (CFG_CFGPCLKGEN4_TC89CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC89CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC89CSEL_REFO3        (CFG_CFGPCLKGEN4_TC89CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC89CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC89CSEL_REFO4        (CFG_CFGPCLKGEN4_TC89CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC89CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC89CSEL_REFO5        (CFG_CFGPCLKGEN4_TC89CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC89CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC89CSEL_REFO6        (CFG_CFGPCLKGEN4_TC89CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC89CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC89CSEL_LPCLK        (CFG_CFGPCLKGEN4_TC89CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC89CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC89CD_Pos            _UINT32_(23)                                         /* (CFG_CFGPCLKGEN4) TC89 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC89CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC89CD_Pos)        /* (CFG_CFGPCLKGEN4) TC89 Clock Disable Mask */
