Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/cfg.h
#define CFG_PMD3CLR_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD3CLR) Register Mask  */


/* -------- CFG_PMD3SET : (CFG Offset: 0x108) (R/W 32) Bit set register -------- */
#define CFG_PMD3SET_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD3SET) Bit set register  Reset Value */

#define CFG_PMD3SET_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD3SET) Register Mask  */


/* -------- CFG_PMD3INV : (CFG Offset: 0x10C) (R/W 32) Bit invert register -------- */
#define CFG_PMD3INV_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_PMD3INV) Bit invert register  Reset Value */

#define CFG_PMD3INV_Msk                       _UINT32_(0x00000000)                                 /* (CFG_PMD3INV) Register Mask  */


/* -------- CFG_MISCSTAT : (CFG Offset: 0x120) (R/W 32)  -------- */
#define CFG_MISCSTAT_RESETVALUE               _UINT32_(0x1000081)                                  /*  (CFG_MISCSTAT)   Reset Value */

#define CFG_MISCSTAT_CLDORDY_Pos              _UINT32_(9)                                          /* (CFG_MISCSTAT) CLDO Ready Position */
#define CFG_MISCSTAT_CLDORDY_Msk              (_UINT32_(0x1) << CFG_MISCSTAT_CLDORDY_Pos)          /* (CFG_MISCSTAT) CLDO Ready Mask */
#define CFG_MISCSTAT_CLDORDY(value)           (CFG_MISCSTAT_CLDORDY_Msk & (_UINT32_(value) << CFG_MISCSTAT_CLDORDY_Pos)) /* Assigment of value for CLDORDY in the CFG_MISCSTAT register */
#define CFG_MISCSTAT_Msk                      _UINT32_(0x00000200)                                 /* (CFG_MISCSTAT) Register Mask  */


/* -------- CFG_ID : (CFG Offset: 0x160) ( R/ 32) Device ID -------- */
#define CFG_ID_RESETVALUE                     _UINT32_(0x00)                                       /*  (CFG_ID) Device ID  Reset Value */

#define CFG_ID_Msk                            _UINT32_(0x00000000)                                 /* (CFG_ID) Register Mask  */


/* -------- CFG_BCFG0 : (CFG Offset: 0x200) ( R/ 32)  -------- */
#define CFG_BCFG0_RESETVALUE                  _UINT32_(0x00)                                       /*  (CFG_BCFG0)   Reset Value */

#define CFG_BCFG0_PCSCMODE_Pos                _UINT32_(1)                                          /* (CFG_BCFG0) PCHE Single cache Mode Position */
#define CFG_BCFG0_PCSCMODE_Msk                (_UINT32_(0x1) << CFG_BCFG0_PCSCMODE_Pos)            /* (CFG_BCFG0) PCHE Single cache Mode Mask */
#define CFG_BCFG0_PCSCMODE(value)             (CFG_BCFG0_PCSCMODE_Msk & (_UINT32_(value) << CFG_BCFG0_PCSCMODE_Pos)) /* Assigment of value for PCSCMODE in the CFG_BCFG0 register */
#define CFG_BCFG0_CP_Pos                      _UINT32_(28)                                         /* (CFG_BCFG0) Boot Code Protect Position */
#define CFG_BCFG0_CP_Msk                      (_UINT32_(0x1) << CFG_BCFG0_CP_Pos)                  /* (CFG_BCFG0) Boot Code Protect Mask */
#define CFG_BCFG0_CP(value)                   (CFG_BCFG0_CP_Msk & (_UINT32_(value) << CFG_BCFG0_CP_Pos)) /* Assigment of value for CP in the CFG_BCFG0 register */
#define CFG_BCFG0_SIGN_Pos                    _UINT32_(29)                                         /* (CFG_BCFG0) Flash SIGN Position */
#define CFG_BCFG0_SIGN_Msk                    (_UINT32_(0x1) << CFG_BCFG0_SIGN_Pos)                /* (CFG_BCFG0) Flash SIGN Mask */
#define CFG_BCFG0_SIGN(value)                 (CFG_BCFG0_SIGN_Msk & (_UINT32_(value) << CFG_BCFG0_SIGN_Pos)) /* Assigment of value for SIGN in the CFG_BCFG0 register */
#define CFG_BCFG0_BINFOVALID0_Pos             _UINT32_(31)                                         /* (CFG_BCFG0) First 256-bit BCFG information Valid Position */
#define CFG_BCFG0_BINFOVALID0_Msk             (_UINT32_(0x1) << CFG_BCFG0_BINFOVALID0_Pos)         /* (CFG_BCFG0) First 256-bit BCFG information Valid Mask */
#define CFG_BCFG0_BINFOVALID0(value)          (CFG_BCFG0_BINFOVALID0_Msk & (_UINT32_(value) << CFG_BCFG0_BINFOVALID0_Pos)) /* Assigment of value for BINFOVALID0 in the CFG_BCFG0 register */
#define CFG_BCFG0_Msk                         _UINT32_(0xB0000002)                                 /* (CFG_BCFG0) Register Mask  */

#define CFG_BCFG0_BINFOVALID_Pos              _UINT32_(31)                                         /* (CFG_BCFG0 Position) First 256-bit BCFG information Valid */
#define CFG_BCFG0_BINFOVALID_Msk              (_UINT32_(0x1) << CFG_BCFG0_BINFOVALID_Pos)          /* (CFG_BCFG0 Mask) BINFOVALID */
#define CFG_BCFG0_BINFOVALID(value)           (CFG_BCFG0_BINFOVALID_Msk & (_UINT32_(value) << CFG_BCFG0_BINFOVALID_Pos)) 

/** \brief CFG register offsets definitions */
#define CFG_CFGCON0_REG_OFST           _UINT32_(0x00)      /* (CFG_CFGCON0)  Offset */
#define CFG_CFGCON0CLR_REG_OFST        _UINT32_(0x04)      /* (CFG_CFGCON0CLR) Bit clear register Offset */
#define CFG_CFGCON0SET_REG_OFST        _UINT32_(0x08)      /* (CFG_CFGCON0SET) Bit set register Offset */
#define CFG_CFGCON0INV_REG_OFST        _UINT32_(0x0C)      /* (CFG_CFGCON0INV) Bit invert register Offset */
#define CFG_CFGCON1_REG_OFST           _UINT32_(0x10)      /* (CFG_CFGCON1)  Offset */
#define CFG_CFGCON1CLR_REG_OFST        _UINT32_(0x14)      /* (CFG_CFGCON1CLR) Bit clear register Offset */
#define CFG_CFGCON1SET_REG_OFST        _UINT32_(0x18)      /* (CFG_CFGCON1SET) Bit set register Offset */
#define CFG_CFGCON1INV_REG_OFST        _UINT32_(0x1C)      /* (CFG_CFGCON1INV) Bit invert register Offset */
#define CFG_CFGCON2_REG_OFST           _UINT32_(0x20)      /* (CFG_CFGCON2)  Offset */
#define CFG_CFGCON2CLR_REG_OFST        _UINT32_(0x24)      /* (CFG_CFGCON2CLR) Bit clear register Offset */
#define CFG_CFGCON2SET_REG_OFST        _UINT32_(0x28)      /* (CFG_CFGCON2SET) Bit set register Offset */
#define CFG_CFGCON2INV_REG_OFST        _UINT32_(0x2C)      /* (CFG_CFGCON2INV) Bit invert register Offset */
#define CFG_CFGCON4_REG_OFST           _UINT32_(0x40)      /* (CFG_CFGCON4)  Offset */
#define CFG_CFGCON4CLR_REG_OFST        _UINT32_(0x44)      /* (CFG_CFGCON4CLR) Bit clear register Offset */
#define CFG_CFGCON4SET_REG_OFST        _UINT32_(0x48)      /* (CFG_CFGCON4SET) Bit set register Offset */
#define CFG_CFGCON4INV_REG_OFST        _UINT32_(0x4C)      /* (CFG_CFGCON4INV) Bit invert register Offset */
#define CFG_CFGPGQOS1_REG_OFST         _UINT32_(0x50)      /* (CFG_CFGPGQOS1)  Offset */
#define CFG_CFGPGQOS1CLR_REG_OFST      _UINT32_(0x54)      /* (CFG_CFGPGQOS1CLR) Bit clear register Offset */
#define CFG_CFGPGQOS1SET_REG_OFST      _UINT32_(0x58)      /* (CFG_CFGPGQOS1SET) Bit set register Offset */
#define CFG_CFGPGQOS1INV_REG_OFST      _UINT32_(0x5C)      /* (CFG_CFGPGQOS1INV) Bit invert register Offset */
#define CFG_CFGPGQOS2_REG_OFST         _UINT32_(0x60)      /* (CFG_CFGPGQOS2)  Offset */
#define CFG_CFGPGQOS2CLR_REG_OFST      _UINT32_(0x64)      /* (CFG_CFGPGQOS2CLR) Bit clear register Offset */
#define CFG_CFGPGQOS2SET_REG_OFST      _UINT32_(0x68)      /* (CFG_CFGPGQOS2SET) Bit set register Offset */
#define CFG_CFGPGQOS2INV_REG_OFST      _UINT32_(0x6C)      /* (CFG_CFGPGQOS2INV) Bit invert register Offset */
#define CFG_CFGI2C_REG_OFST            _UINT32_(0x70)      /* (CFG_CFGI2C)  Offset */
#define CFG_CFGI2CCLR_REG_OFST         _UINT32_(0x74)      /* (CFG_CFGI2CCLR) Bit clear register Offset */
#define CFG_CFGI2CSET_REG_OFST         _UINT32_(0x78)      /* (CFG_CFGI2CSET) Bit set register Offset */
#define CFG_CFGI2CINV_REG_OFST         _UINT32_(0x7C)      /* (CFG_CFGI2CINV) Bit invert register Offset */
#define CFG_CFGPCLKGEN1_REG_OFST       _UINT32_(0x80)      /* (CFG_CFGPCLKGEN1)  Offset */
#define CFG_CFGPCLKGEN1CLR_REG_OFST    _UINT32_(0x84)      /* (CFG_CFGPCLKGEN1CLR) Bit clear register Offset */
#define CFG_CFGPCLKGEN1SET_REG_OFST    _UINT32_(0x88)      /* (CFG_CFGPCLKGEN1SET) Bit set register Offset */
#define CFG_CFGPCLKGEN1INV_REG_OFST    _UINT32_(0x8C)      /* (CFG_CFGPCLKGEN1INV) Bit invert register Offset */
#define CFG_CFGPCLKGEN2_REG_OFST       _UINT32_(0x90)      /* (CFG_CFGPCLKGEN2)  Offset */
#define CFG_CFGPCLKGEN2CLR_REG_OFST    _UINT32_(0x94)      /* (CFG_CFGPCLKGEN2CLR) Bit clear register Offset */
#define CFG_CFGPCLKGEN2SET_REG_OFST    _UINT32_(0x98)      /* (CFG_CFGPCLKGEN2SET) Bit set register Offset */
#define CFG_CFGPCLKGEN2INV_REG_OFST    _UINT32_(0x9C)      /* (CFG_CFGPCLKGEN2INV) Bit invert register Offset */
#define CFG_CFGPCLKGEN3_REG_OFST       _UINT32_(0xA0)      /* (CFG_CFGPCLKGEN3)  Offset */
#define CFG_CFGPCLKGEN3CLR_REG_OFST    _UINT32_(0xA4)      /* (CFG_CFGPCLKGEN3CLR) Bit clear register Offset */
#define CFG_CFGPCLKGEN3SET_REG_OFST    _UINT32_(0xA8)      /* (CFG_CFGPCLKGEN3SET) Bit set register Offset */
#define CFG_CFGPCLKGEN3INV_REG_OFST    _UINT32_(0xAC)      /* (CFG_CFGPCLKGEN3INV) Bit invert register Offset */
#define CFG_CFGPCLKGEN4_REG_OFST       _UINT32_(0xB0)      /* (CFG_CFGPCLKGEN4)  Offset */
#define CFG_CFGPCLKGEN4CLR_REG_OFST    _UINT32_(0xB4)      /* (CFG_CFGPCLKGEN4CLR) Bit clear register Offset */
#define CFG_CFGPCLKGEN4SET_REG_OFST    _UINT32_(0xB8)      /* (CFG_CFGPCLKGEN4SET) Bit set register Offset */
#define CFG_CFGPCLKGEN4INV_REG_OFST    _UINT32_(0xBC)      /* (CFG_CFGPCLKGEN4INV) Bit invert register Offset */
#define CFG_USER_ID_REG_OFST           _UINT32_(0xC0)      /* (CFG_USER_ID)  Offset */
#define CFG_USER_IDCLR_REG_OFST        _UINT32_(0xC4)      /* (CFG_USER_IDCLR) Bit clear register Offset */
#define CFG_USER_IDSET_REG_OFST        _UINT32_(0xC8)      /* (CFG_USER_IDSET) Bit set register Offset */
#define CFG_USER_IDINV_REG_OFST        _UINT32_(0xCC)      /* (CFG_USER_IDINV) Bit invert register Offset */
#define CFG_SYSKEY_REG_OFST            _UINT32_(0xD0)      /* (CFG_SYSKEY)  Offset */
#define CFG_PMD1_REG_OFST              _UINT32_(0xE0)      /* (CFG_PMD1)  Offset */
#define CFG_PMD1CLR_REG_OFST           _UINT32_(0xE4)      /* (CFG_PMD1CLR) Bit clear register Offset */
#define CFG_PMD1SET_REG_OFST           _UINT32_(0xE8)      /* (CFG_PMD1SET) Bit set register Offset */
#define CFG_PMD1INV_REG_OFST           _UINT32_(0xEC)      /* (CFG_PMD1INV) Bit invert register Offset */
#define CFG_PMD2_REG_OFST              _UINT32_(0xF0)      /* (CFG_PMD2)  Offset */
#define CFG_PMD2CLR_REG_OFST           _UINT32_(0xF4)      /* (CFG_PMD2CLR) Bit clear register Offset */
#define CFG_PMD2SET_REG_OFST           _UINT32_(0xF8)      /* (CFG_PMD2SET) Bit set register Offset */
#define CFG_PMD2INV_REG_OFST           _UINT32_(0xFC)      /* (CFG_PMD2INV) Bit invert register Offset */
#define CFG_PMD3_REG_OFST              _UINT32_(0x100)     /* (CFG_PMD3)  Offset */
#define CFG_PMD3CLR_REG_OFST           _UINT32_(0x104)     /* (CFG_PMD3CLR) Bit clear register Offset */
#define CFG_PMD3SET_REG_OFST           _UINT32_(0x108)     /* (CFG_PMD3SET) Bit set register Offset */
#define CFG_PMD3INV_REG_OFST           _UINT32_(0x10C)     /* (CFG_PMD3INV) Bit invert register Offset */
#define CFG_MISCSTAT_REG_OFST          _UINT32_(0x120)     /* (CFG_MISCSTAT)  Offset */
#define CFG_ID_REG_OFST                _UINT32_(0x160)     /* (CFG_ID) Device ID Offset */
#define CFG_BCFG0_REG_OFST             _UINT32_(0x200)     /* (CFG_BCFG0)  Offset */

